Revit 2024 API
BuiltInFailures.StairRampFailures.NotALineRiserRampError Property
 Riser line must be a straight line for Ramps.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotALineRiserRampError { get; }
Visual Basic
Public Shared ReadOnly Property NotALineRiserRampError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotALineRiserRampError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace